shantanugoel/hearth/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_CODEC_ES8311_SUPPORT=y

# NOTE4 is ESP32-S3 N16R8: 16 MB flash, 8 MB octal PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_FREERTOS_HZ=1000

# The NOTE4 exposes only USB-Serial/JTAG. Make USB the primary console so
# logs and the provisioning REPL work over /dev/ttyACM0.
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Task WDT max is 60 s on IDF 6.1. The hub POST unsubscribes the main
# task for the duration of the call; HTTP events still reset it otherwise.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_LWIP_SO_RCVBUF=y

# Hub is HTTP on the LAN. Skip TLS to keep the image small.
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n

# Put the household hub URL in sdkconfig.defaults.local or set it over USB.
CONFIG_HEARTH_HUB_URL=""
